# BasicLossFactor Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BasicLossFactor Class
Members See Also
---
This class encapsulates basic lighting loss factor calculation.
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class BasicLossFactor : LossFactor
```

Visual Basic
---
```text
Public Class BasicLossFactor _
	Inherits LossFactor
```

Visual C++
---
```text
public ref class BasicLossFactor : public LossFactor
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Lighting..::..LossFactor Autodesk.Revit.DB.Lighting..::..BasicLossFactor
# See Also
BasicLossFactor Members
Autodesk.Revit.DB.Lighting Namespace